БИТУправление_медицинским_центром_демо/src/InformationRegisters/ЛекарственнаяНепереносимость/ЛекарственнаяНепереносимость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛекарственнаяНепереносимость</name>
  <resources>
    <name>Реакция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДействующееВещество</name>
    <type>
      <types>CatalogRef.ДействующиеВеществаЛекарственныхПрепаратов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ЛекарственнаяНепереносимость/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ОписаниеНепереносимостейКлиента(Клиент) Экспорт
	
	Описание = "";
	
	ШаблонЗаписи = "%1 на: %2";
	
	НЗ = РегистрыСведений.ЛекарственнаяНепереносимость.СоздатьНаборЗаписей();
	НЗ.Отбор.Клиент.Установить(Клиент);
	НЗ.Прочитать();
	
	ТЗ = НЗ.Выгрузить();
	
	Реакции = ОбщегоНазначения.ВыгрузитьКолонку(ТЗ, "Реакция");
	
	Для Каждого Реакция Из Реакции Цикл
		
		ОписаниеЗаписи = "";
		Вещества = "";
		
		Записи = ТЗ.НайтиСтроки(Новый Структура("Реакция", Реакция));
		Для Каждого Запись Из НЗ Цикл
			ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(Вещества, Запись.ДействующееВещество, ", ", Истина);
		КонецЦикла;
		
		ОписаниеЗаписи = СтрШаблон(ШаблонЗаписи, Реакция, Вещества);
		
		ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(Описание, ОписаниеЗаписи, "; ");
	КонецЦикла;
	
	Возврат Описание;
	
КонецФункции

#КонецОбласти
